GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/**
 * @file    gpio_ll.h
 * @author  Shrey Shah
 * @brief   GPIO Low-Level Hardware Instruction Layer
 * @version v1.2
 * @date    24-10-2025
 *
 * @details
 * This header defines the **Low Level (LL)** GPIO API for STM32F103C8T6.
 * All functions directly map to hardware registers (CRL/CRH/ODR/IDR/BSRR/BRR)
 * and provide atomic bit-level access.
 *
 * The file is modular by design:
 * - Core LL functions are always compiled.
 * - Optional commit/IRQ layers can be enabled via compile-time flags
 * 
 */

#ifndef GPIO_LL_H_
#define GPIO_LL_H_

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/*---------------------------------------------- Includes ----------------------------------------------*/
/** 
 * @brief For register mapping base types
 * @include @file stm32f1xx.h 
 */
#include "stm32f1xx.h"

// ######################################################################################################
// GPIO Register APIs
// ######################################################################################################

/**
 * @addtogroup GPIO_01_Registers
 * @{
 */

/**
 * @defgroup GPIO_01_Registers_04_API GPIO Register Access APIs
 * @ingroup GPIO_01_Registers
 * @brief APIs to access @ref GPIO_01_Registers_01_Structure "GPIO Registers"
 * @{
 */

/*---------------------------------------------- GPIO Configuration ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_01_CRx GPIO Configuration Register APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Direct pin mode and configuration access (CRL/CRH)
 * @{
 */

/**
 * @brief 				Reads @ref GPIO_TypeDef_CRL "CRL"
 * @param[in] GPIOx		Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @returns				CRL
 * @ref GPIO_Pins_Summary "GPIO Pin Summary"
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadCRL(GPIO_TypeDef* const GPIOx)
{
	return (uint32_t) GPIOx->CRL.REG;
}

/**
 * @brief				Writes @ref GPIO_TypeDef_CRL "CRL"
 * @param[in] GPIOx		Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] value		Updated Value to be written
 * @ref GPIO_Pins_Summary "GPIO Pin Summary"
 */
__STATIC_FORCEINLINE void __GPIO_WriteCRL(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->CRL.REG = value;
}

/**
 * @brief				Reads @ref GPIO_TypeDef_CRH "CRH"
 * @param[in] GPIOx		Target @ref GPIO_03_Registers_03_Memory "GPIO Port" 
 * @returns				CRH
 * @ref GPIO_Pins_Summary "GPIO Pin Summary" 
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadCRH(GPIO_TypeDef* const GPIOx)
{
	return (uint32_t) GPIOx->CRH.REG;
}

/**
 * @brief				Writes @ref GPIO_TypeDef_CRH "CRH"
 * @param[in] GPIOx		Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] value		Updated Value to be written
 * @ref GPIO_Pins_Summary "GPIO Pin Summary"
 */
__STATIC_FORCEINLINE void __GPIO_WriteCRH(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->CRH.REG = value;
}

/** @} */ // GPIO_01_Registers_04_API_01_CRx

/*---------------------------------------------- GPIO Output Operations ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_02_Output GPIO Output APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Output write operations
 * @{
 */

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_ODR "ODR"
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] value Updated 32-bit @ref GPIO_TypeDef_ODR "ODR" value
 */
__STATIC_FORCEINLINE void __GPIO_WriteODR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->ODR.REG = value;
}

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_BSRR "BSRR"
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] value Updated 32-bit @ref GPIO_TypeDef_BSRR "BSRR" value
 */
__STATIC_FORCEINLINE void __GPIO_WriteBSRR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->BSRR.REG = value;
}

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_BRR "BRR"
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] value Updated 32-bit @ref GPIO_TypeDef_BRR "BRR" value
 */
__STATIC_FORCEINLINE void __GPIO_WriteBRR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->BRR.REG = value;
}

/** @} */ // GPIO_01_Registers_04_API_02_Output

/*---------------------------------------------- GPIO Input Operations ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_03_Input GPIO Input APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Reads current input state from GPIO pins
 * @{
 */

/**
 * @brief Reads @ref GPIO_TypeDef_IDR "IDR"
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @returns Value read from @ref GPIO_TypeDef_IDR "IDR"
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadIDR(const GPIO_TypeDef* const GPIOx)
{
	return (uint32_t)(GPIOx->IDR.REG);
}

/**
 * @brief Reads @ref GPIO_TypeDef_ODR "ODR"
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @returns Value read from @ref GPIO_TypeDef_ODR "ODR"
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadODR(const GPIO_TypeDef* const GPIOx)
{
	return (uint32_t)(GPIOx->ODR.REG);
}

/** @} */ // GPIO_01_Registers_04_API_03_Input

/*---------------------------------------------- GPIO Lock Operations ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_04_Lock GPIO Lock APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Locks the state of GPIO pins until next reset
 * @{
 */

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_LCKR "LCKR"
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] value Updated 32-bit @ref GPIO_TypeDef_LCKR "LCKR" value 
 */
__STATIC_FORCEINLINE void __GPIO_WriteLCKR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->LCKR.REG = value;
} 

/**
 * @brief Reads an entire pattern from @ref GPIO_TypeDef_LCKR "LCKR"
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @returns Value read from @ref GPIO_TypeDef_LCKR "LCKR"
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadLCKR(GPIO_TypeDef* const GPIOx)
{
	return (GPIOx->LCKR.REG);
} 

/** @} */ // GPIO_01_Registers_04_API_04_Lock

/** @} */ // GPIO_01_Registers_04_API

/** @} */ // GPIO_01_Registers

// ######################################################################################################
// GPIO Low Level APIs: LL
// ######################################################################################################

/**
 * @brief GPIO Low Level APIs
 * @defgroup GPIO_02_LL GPIO Low Level APIs
 * @ingroup GPIO
 * 
 * @{
 */

/*---------------------------------------------- GPIO LL Clock ----------------------------------------------*/
/**
 * @brief GPIO Low Level Clock APIs
 * @defgroup GPIO_02_LL_01_Clock GPIO LL Clock APIs
 * @ingroup GPIO_02_LL
 * @{
 */

/**
 * @brief Compute the RCC clock-enable bit position for a GPIO port
 *
 * @details
 * Determines the **relative bit position** of a GPIO port within `RCC->APB2ENR`
 * by calculating its offset from @ref GPIOA using @ref BIT_POS.
 *
 * The result provides a **zero-based index** for clock-enable bit positioning.
 * This is purely compile-time arithmetic — no hardware access occurs.
 *
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 *
 * @return Zero-based index of the GPIO port relative to GPIOA
 *
 * @see @ref BIT_POS
 * @see @ref _GPIO_EnableClock()
 * @see @ref _GPIO_DisableClock()
 *
 * @par Example:
 * @code
 * uint32_t pos = GPIO_CLK_POS(GPIOC);  // GPIOC → index 2
 * RCC->APB2ENR |= (1U << (RCC_APB2ENR_IOPAEN_Pos + pos));
 * @endcode
 * 
 * @def GPIO_CLK_POS
 */
#define GPIO_CLK_POS(GPIOx) 						BIT_POS((GPIOx), GPIOA, GPIO_PERIPHERAL_SIZE)

/**
 * @brief Compute the RCC clock-enable bitmask for a GPIO port
 *
 * @details
 * Generates the bitmask corresponding to a GPIO port’s enable bit in 
 * `RCC->APB2ENR` using @ref GPIO_CLK_POS to determine its bit position.
 *
 * This macro provides a ready-to-use mask for enabling or disabling
 * the clock for a specific GPIO port.
 *
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 *
 * @return Bitmask for the GPIO port’s clock-enable bit
 *
 * @see @ref GPIO_CLK_POS
 * @see @ref _GPIO_EnableClock
 * @see @ref _GPIO_DisableClock
 *
 * @par Example:
 * @code
 * // Enable GPIOB clock
 * RCC->APB2ENR |= GPIO_CLK_MASK(GPIOB);
 *
 * // Disable GPIOB clock
 * RCC->APB2ENR &= ~GPIO_CLK_MASK(GPIOB);
 * @endcode
 * 
 * @def GPIO_CLK_MASK
 */
#define GPIO_CLK_MASK(GPIOx) \
	((uint32_t) (0x01UL << ((RCC_APB2ENR_IOPAEN_Pos + GPIO_CLK_POS(GPIOx)) & ((uint32_t) 0x1F))))

/**
 * @brief Enable GPIO Peripheral Clock
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 */
__STATIC_FORCEINLINE void _GPIO_EnableClock(GPIO_TypeDef* const GPIOx)
{
	RCC->APB2ENR.REG |= GPIO_CLK_MASK(GPIOx);
}

/**
 * @brief Disable GPIO Peripheral Clock
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 */
__STATIC_FORCEINLINE void _GPIO_DisableClock(GPIO_TypeDef* const GPIOx)
{
	RCC->APB2ENR.REG &= ~GPIO_CLK_MASK(GPIOx);
}

/**
 * @brief Enables AFIO Clock
 */
__STATIC_FORCEINLINE void _GPIO_EnableAFIOClock(void)
{
	RCC->APB2ENR.REG |= RCC_APB2ENR_AFIOEN;
}

/** @} */ // GPIO_02_LL_01_Clock


/**
 * @brief GPIO Low Level Pin APIs
 * @defgroup GPIO_02_LL_02_Pin GPIO LL Pin APIs
 * @ingroup GPIO_02_LL
 * 
 * @{
 */

/**
 * @brief GPIO Pin Identifier Type
 * 
 * @details
 * Type-safe abstraction for GPIO pin identifiers. Using a typedef allows for
 * easy portability across different microcontroller architectures and future
 * enhancements without modifying function prototypes.
 * 
 * - **Current implementation**: `uint8_t` (0-255 range, supports up to 256 pins)
 * - **Future flexibility**: Can change to `uint16_t` for larger pin counts
 * - **Type safety**: Prevents accidental mixing with other integer types
 * - **Documentation clarity**: Self-documenting pin parameters
 * 
 * @note Changing the underlying type requires updating only this typedef and
 *       the pin constant definitions - all function signatures remain unchanged.
 * 
 * @example
 * @code
 * // Current usage (uint8_t based):
 * _gpio_pin_t led_pin = _GPIO_PIN_13;
 * _GPIO_SetPin(GPIOA, led_pin);
 * 
 * // Future usage (if changed to uint16_t):
 * // No code changes required in function calls!
 * @endcode
 */
/** @brief GPIO Pin Data Type @typedef _gpio_pin_t */
typedef uint8_t _gpio_pin_t;
/** @brief GPIO Pin 0 @def _GPIO_PIN_0 */
#define _GPIO_PIN_0						((_gpio_pin_t)0x00)
/** @brief GPIO Pin 1 @def _GPIO_PIN_1 */
#define _GPIO_PIN_1						((_gpio_pin_t)0x01)
/** @brief GPIO Pin 2 @def _GPIO_PIN_2 */
#define _GPIO_PIN_2						((_gpio_pin_t)0x02)
/** @brief GPIO Pin 3 @def _GPIO_PIN_3 */
#define _GPIO_PIN_3						((_gpio_pin_t)0x03)
/** @brief GPIO Pin 4 @def _GPIO_PIN_4 */
#define _GPIO_PIN_4						((_gpio_pin_t)0x04)
/** @brief GPIO Pin 5 @def _GPIO_PIN_5 */
#define _GPIO_PIN_5						((_gpio_pin_t)0x05)
/** @brief GPIO Pin 6 @def _GPIO_PIN_6 */
#define _GPIO_PIN_6						((_gpio_pin_t)0x06)
/** @brief GPIO Pin 7 @def _GPIO_PIN_7 */
#define _GPIO_PIN_7						((_gpio_pin_t)0x07)
/** @brief GPIO Pin 8 @def _GPIO_PIN_8 */
#define _GPIO_PIN_8						((_gpio_pin_t)0x08)
/** @brief GPIO Pin 9 @def _GPIO_PIN_9 */
#define _GPIO_PIN_9						((_gpio_pin_t)0x09)
/** @brief GPIO Pin 10 @def _GPIO_PIN_10 */
#define _GPIO_PIN_10					((_gpio_pin_t)0x0A)
/** @brief GPIO Pin 11 @def _GPIO_PIN_11 */
#define _GPIO_PIN_11					((_gpio_pin_t)0x0B)
/** @brief GPIO Pin 12 @def _GPIO_PIN_12 */
#define _GPIO_PIN_12					((_gpio_pin_t)0x0C)
/** @brief GPIO Pin 13 @def _GPIO_PIN_13 */
#define _GPIO_PIN_13					((_gpio_pin_t)0x0D)
/** @brief GPIO Pin 14 @def _GPIO_PIN_14 */
#define _GPIO_PIN_14					((_gpio_pin_t)0x0E)
/** @brief GPIO Pin 15 @def _GPIO_PIN_15 */
#define _GPIO_PIN_15					((_gpio_pin_t)0x0F)
/** @brief GPIO Max Pin used for Masking  @def _GPIO_MAX_PIN */
#define _GPIO_MAX_PIN					_GPIO_PIN_15

/**
 * @brief Creates a 32-bit mask for a single GPIO Pin
 * @param[in] pin The GPIO pin number (0-15) for which the mask should be created.
 * @return A 32-bit unsigned integer pinMask
 * @note
 * - This implementation assumes a standard 16-pin port structure, as it masks the result with \c 0xFFFFUL
 * - Pins greater than 15 will result in a mask of \c 0x0000UL due to the final AND operation
 * @def GPIO_LL_GET_PIN_MASK
 */
#define GPIO_LL_GET_PIN_MASK(pin)						((uint32_t)((0x01UL << (pin)) & 0xFFFFUL))

/**
 * @brief Extracts the Pin Number (0-15) from a mask with a single bit set
 * @param[in] pinMask A non-zero 32-bit mask with exactly one bit set (e.g., 0x0020UL)
 * @return uint32_t The position of the set bit, which is the Pin Number (0-15)
 * @note This macro uses the highly optimized GCC built-in function `__builtin_ctz`
 * * @def GPIO_LL_EXTRACT_PIN_MASK
 */
#define GPIO_LL_EXTRACT_PIN_MASK(pinMask)		\
	(											\
		((pinMask) != GPIO_PIN_NONE) ?			\
		((_gpio_pin_t)(__builtin_ctz((uint32_t)((pinMask) & _GPIO_MAX_PIN)))) : \
		((_gpio_pin_t) 16)\
	)

/** @} */ // GPIO_02_LL_02_Pin

/**
 * @brief GPIO Low Level Pin Parameter APIs
 * @defgroup GPIO_02_LL_03_PinParams GPIO LL Pin Parameters APIs
 * @ingroup GPIO_02_LL
 * @{
 */

/**
 * @brief GPIO Mode Configuration Type
 * @section GPIO_LL_PinParams_Mode GPIO LL Pin Mode
 * @details
 * Type-safe abstraction for GPIO mode and speed configuration. Using a typedef allows for
 * easy portability and future enhancements without modifying function prototypes.
 * 
 * - **Encapsulates**: MODE field in CRL/CRH registers
 * - **Current implementation**: `uint8_t` (0-3 range for 4 mode types)
 * - **Future flexibility**: Can extend range if new modes are added
 * - **Type safety**: Prevents accidental mixing with configuration types
 * - **Hardware mapping**: Directly maps to 2-bit MODE field in configuration registers
 * 
 * @note Changing the underlying type requires updating only this typedef and
 *       the mode constant definitions - all function signatures remain unchanged.
 * 
 * @{
 */
/** @brief GPIO Mode LL Data Type @typedef _gpio_pin_mode_t */
typedef uint8_t _gpio_pin_mode_t;
/**
 * @section GPIO_LL_PinParams_Mode_Macros GPIO LL Pin Configuration Macros
 * @details Use this for LL
 * @{
 */
/** @brief Input mode @def _GPIO_PIN_MODE_INPUT */
#define _GPIO_PIN_MODE_INPUT						((_gpio_pin_mode_t)0x00)
/** @brief Output mode, max speed 10 MHz @def _GPIO_PIN_MODE_OUTPUT_10MHz */
#define _GPIO_PIN_MODE_OUTPUT_10MHz					((_gpio_pin_mode_t)0x01)
/** @brief Output mode, max speed 2 MHz @def _GPIO_PIN_MODE_OUTPUT_2MHz */
#define _GPIO_PIN_MODE_OUTPUT_2MHz					((_gpio_pin_mode_t)0x02)
/** @brief Output mode, max speed 50 MHz @def _GPIO_PIN_MODE_OUTPUT_50MHz */
#define _GPIO_PIN_MODE_OUTPUT_50MHz					((_gpio_pin_mode_t)0x03)
/** @} */ // GPIO_LL_PinParams_Mode_Macros
/**
 * @brief Creates a mask for the MODE field (bits 1:0 of the 4-bit block)
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param mode @ref GPIO_LL_PinParams_Mode_Macros "Pin Mode Value"
 * @return The final 32-bit mask value
 * @def _GPIO_PIN_MODE_GET_MASK
 */
#define _GPIO_PIN_MODE_GET_MASK(pin, mode) \
    ((uint32_t)(((uint32_t)(mode)) << (((pin) & _GPIO_PIN_7) << 2)))
/**
 * @brief Masks the MODE field (bits 1:0 of the 4-bit block)
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @return The final 32-bit mask value
 * @def _GPIO_PIN_MODE_MASK
 */
#define _GPIO_PIN_MODE_MASK(pin) \
    ((uint32_t)(0x03UL << (((pin) & _GPIO_PIN_7) << 2)))
/**
 * @brief Creates a reset mask for the MODE field (bits 1:0 of the 4-bit block)
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @return The final 32-bit mask value (with 2 bits set to '1')
 * @ref _GPIO_PIN_MODE_GET_MASK "GPIO Pin Mode Mask"
 * @def _GPIO_PIN_MODE_RESET_MASK
 */
#define _GPIO_PIN_MODE_RESET_MASK(pin)						_GPIO_PIN_MODE_GET_MASK(pin, 0x03)

