GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/** @} */ // GPIO_LL_PinParams_Mode

/**
 * @brief GPIO Pin Configuration Type
 * @section GPIO_LL_PinParams_Config GPIO LL Pin Configuration 
 * @details
 * Type-safe abstraction for GPIO electrical configuration. Using a typedef allows for
 * easy portability and future enhancements without modifying function prototypes.
 * 
 * - **Encapsulates**: CNF field in CRL/CRH registers  
 * - **Current implementation**: `uint8_t` (0-3 range for 4 configuration types)
 * - **Future flexibility**: Can extend range if new configurations are added
 * - **Type safety**: Prevents accidental mixing with mode types
 * - **Context dependent**: Interpretation depends on mode (input vs output)
 * - **Hardware mapping**: Directly maps to 2-bit CNF field in configuration registers
 * 
 * @note Interpretation depends on current mode setting:
 *       - Input mode: Analog/Floating/Pull configurations
 *       - Output mode: Push-pull/Open-drain configurations
 * @{
 */
/** @brief GPIO Pin Configuration LL Data Type @typedef _gpio_pin_config_t */
typedef uint8_t _gpio_pin_config_t;
/** @brief GPIO Pull-Up/Pull-Down State @typedef _gpio_pin_pull_state_t */
typedef uint8_t _gpio_pin_pull_state_t;

/**
 * @brief Configuration setting when MODE = Input (0x00)
 * @section GPIO_LL_PinParams_CNF_Input_Macros 
 * @details Use this for LL Input Configuration 
 * @{
 */
/** @brief Input: Analog mode (CNF=0x00) @def _GPIO_PIN_CNF_INPUT_ANALOG */
#define _GPIO_PIN_CNF_INPUT_ANALOG						((_gpio_pin_config_t) 0x00)
/** @brief Input: Floating input (CNF=0x01) @def _GPIO_PIN_CNF_INPUT_FLOATING */
#define _GPIO_PIN_CNF_INPUT_FLOATING					((_gpio_pin_config_t) 0x01)
/** @brief Input: Pull-up/Pull-down (CNF=0x02) @def _GPIO_PIN_CNF_INPUT_PULL */
#define _GPIO_PIN_CNF_INPUT_PULL						((_gpio_pin_config_t) 0x02)
/** @brief Input: Reserved (CNF=0x03) @def _GPIO_PIN_CNF_INPUT_RESERVED */
#define _GPIO_PIN_CNF_INPUT_RESERVED					((_gpio_pin_config_t) 0x03)

/**
 * @brief LL Constants for setting the Pull-Up/Pull-Down state in the ODR register.
 * @section GPIO_LL_PinParams_CNF_Input_Macros_PullConfig 
 * @details Use this for LL PULL Staging 
 * @{
 */
/** @brief Sets the ODR bit to '0' for PULL-DOWN activation. @def _GPIO_PIN_CNF_INPUT_PULL_DOWN */
#define _GPIO_PIN_CNF_INPUT_PULL_DOWN					((_gpio_pin_pull_state_t) 0x00)
/** @brief Sets the ODR bit to '1' for PULL-UP activation. @def _GPIO_PIN_CNF_INPUT_PULL_UP */
#define _GPIO_PIN_CNF_INPUT_PULL_UP						((_gpio_pin_pull_state_t) 0x01)

/** @} */ // GPIO_LL_PinParams_CNF_Input_Macros_PullConfig

/** @} */ // GPIO_LL_PinParams_CNF_Input_Macros

/**
 * @brief Configuration setting when MODE = Output/AF (0x01, 0x02, 0x03)
 * @section GPIO_LL_PinParams_CNF_Output_Macros 
 * @details Use this for LL Output Configuration 
 * @{
 */
/** @brief Output: General Purpose Push-pull (CNF=0x00) @def _GPIO_PIN_CNF_OUTPUT_PP */
#define _GPIO_PIN_CNF_OUTPUT_PP							((_gpio_pin_config_t) 0x00)
/** @brief Output: General Purpose Open-drain (CNF=0x01) @def _GPIO_PIN_CNF_OUTPUT_OD */
#define _GPIO_PIN_CNF_OUTPUT_OD							((_gpio_pin_config_t) 0x01)
/** @brief Output: Alternate Function Push-pull (CNF=0x02) @def _GPIO_PIN_CNF_AF_PP */
#define _GPIO_PIN_CNF_AF_PP								((_gpio_pin_config_t) 0x02)
/** @brief Output: Alternate Function Open-drain (CNF=0x03) @def _GPIO_PIN_CNF_AF_OD */
#define _GPIO_PIN_CNF_AF_OD								((_gpio_pin_config_t) 0x03)

/** @} */ // GPIO_LL_PinParams_CNF_Output_Macros

/** @} */ // GPIO_LL_PinParams_Config_Macros

/**
 * @brief Creates a mask for the CNF field (bits 3:2 of the 4-bit block).
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param cnf @ref GPIO_LL_PinParams_Config_Macros "Pin Configuration Value"
 * @return The final 32-bit mask value
 * @def _GPIO_PIN_CNF_GET_MASK
 */
#define _GPIO_PIN_CNF_GET_MASK(pin, cnf) \
	((uint32_t)(((uint32_t)(cnf)) << ((((pin) & _GPIO_PIN_7) << 2) + 2)))
/**
 * @brief Masks the CNF field (bits 3:2 of the 4-bit block).
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @return The final 32-bit mask value
 * @def _GPIO_PIN_CNF_MASK
 */
#define _GPIO_PIN_CNF_MASK(pin) \
	((uint32_t)((0x03UL) << ((((pin) & _GPIO_PIN_7) << 2) + 2)))
/**
 * @brief Creates a reset mask for the CNF field (bits 3:2 of the 4-bit block).
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number" (0-15).
 * @return The final 32-bit mask value (with 2 bits set to '1').
 * @ref _GPIO_PIN_CNF_GET_MASK "GPIO Pin Configuration Mask"
 * @def _GPIO_PIN_CNF_RESET_MASK
 */
#define _GPIO_PIN_CNF_RESET_MASK(pin)							_GPIO_PIN_CNF_GET_MASK(pin, 0x03)	

/** @} */ // GPIO_LL_PinParams_Config

/**
 * @brief Masks the CNF & MODE field (bits 3:0 of the 4-bit block)
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @return The final 32-bit mask value
 * @def _GPIO_PIN_CNF_MODE_MASK
 */
#define _GPIO_PIN_CNF_MODE_MASK(pin) \
	((uint32_t)(0x0FUL) << (((pin) & _GPIO_PIN_7) << 2))

/** @} */ // GPIO_02_LL_03_PinParams

/**
 * @brief GPIO Low Level Lock APIs
 * @defgroup GPIO_02_LL_03_Lock GPIO LL Locking APIs
 * @ingroup GPIO_02_LL
 * @{
 */

/**
 * @brief GPIO Lock Status Type
 * @section GPIO_LL_Lock GPIO LL Lock Macros 
 * @details
 * Type-safe abstraction for GPIO lock operation results. Provides clear
 * status reporting for lock configuration operations without using enums.
 * 
 * - **0x00**: Lock operation completed successfully
 * - **0x01**: Lock operation failed (hardware verification failed)
 * - **0x02**: Lock is currently active and enforced
 * - **0x03**: Lock is not active or has been reset
 * 
 * @note Lock status is verified by reading back the LCKR register and
 *       checking the LCKK bit after the locking sequence completes.
 * 
 * @example
 * @code
 * _gpio_lock_status_t status = _GPIO_LockPin(GPIOA, _GPIO_PIN_5);
 * if (status == _GPIO_LOCK_SUCCESS) 
 * {
 *     // Pin successfully locked until next reset
 * }
 * @endcode 
 * 
 */
/** @brief GPIO Lock LL Data Type @typedef _gpio_lock_status_t */
typedef uint8_t _gpio_lock_status_t;
/** @brief Lock operation completed successfully @def _GPIO_LOCK_SUCCESS */
#define _GPIO_LOCK_SUCCESS									((_gpio_lock_status_t) 0x00)
/** @brief Lock operation failed @def _GPIO_LOCK_FAILED */
#define _GPIO_LOCK_FAILED									((_gpio_lock_status_t) 0x01)
/** @brief Lock is currently active @def _GPIO_LOCK_ENABLED */
#define _GPIO_LOCK_ENABLED									((_gpio_lock_status_t) 0x02)
/** @brief Lock is not active @def _GPIO_LOCK_DISABLED */
#define _GPIO_LOCK_DISABLED									((_gpio_lock_status_t) 0x03)

