GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/** @} */ // GPIO_02_LL_03_Lock */

/**
 * @section GPIO_LL_Mode_Stage GPIO Low Level Mode Stage APIs
 * @ingroup GPIO_02_LL_03_PinParams
 * @{
 */

/**
 * @brief Stage GPIO Pin Mode Configuration into input register
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] mode Value of @ref GPIO_LL_PinParams_Mode_Macros "GPIO Pin Mode"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @returns The updated staged register value with Pin Mode
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH
 * @note - Register Value to be provided as input
 * @see @ref GPIO_Pins_Mode "GPIO Pin Mode Theory"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageMode(const _gpio_pin_t pin, const _gpio_pin_mode_t mode, uint32_t crxReg)
{
	crxReg &= ~_GPIO_PIN_MODE_RESET_MASK(pin);
	crxReg |= _GPIO_PIN_MODE_GET_MASK(pin, mode);
	return crxReg;
}

/**
 * @brief Stage GPIO Pin Configuration into the input register
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] config Value of @ref GPIO_LL_PinParams_Config_Macros "GPIO Pin Configuration"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @returns The updated staged register value with Pin Configuration
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH (CRx)
 * @note - Register Value to be provided as input
 * @see @ref @ref GPIO_LL_PinParams_Config "GPIO Pin Configuration Theory"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageConfig(const _gpio_pin_t pin, const _gpio_pin_config_t config, uint32_t crxReg)
{
	crxReg &= ~_GPIO_PIN_CNF_RESET_MASK(pin);
	crxReg |= _GPIO_PIN_CNF_GET_MASK(pin, config);
	return crxReg; 
}

/**
 * @brief Stage GPIO Pin Mode and Configuration into the input register
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] mode Value of @ref GPIO_LL_PinParams_Mode_Macros "GPIO Pin Mode"
 * @param[in] config Value of @ref GPIO_LL_PinParams_Config_Macros "GPIO Pin Configuration"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @returns The updated staged register value with Pin Mode and Configuration
 * @note - This function simplifies User API configuration by wrapping _GPIO_PinStageMode and _GPIO_PinStageConfig.
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH (CRx)
 * @note - Register Value to be provided as input
 * @see @ref _GPIO_PinStageMode "GPIO Pin Mode Staging API" | @ref _GPIO_PinStageConfig "GPIO Pin Configuration Staging API"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageParams(const _gpio_pin_t pin, const _gpio_pin_mode_t mode, const _gpio_pin_config_t config, uint32_t crxReg)
{
	return _GPIO_PinStageConfig(pin, config, _GPIO_PinStageMode(pin, mode, crxReg));
}

/**
 * @brief Stages the GPIO Pin to default mode
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] crxReg The current staged CRL/CRH (CRx) value
 * @note Sets the Pin to Default (Input Floating) State
 * @note - Preferred usage is during batch update for configuration
 * @note - Register should be updated instance of either CRL/CRH (CRx)
 * @note - Register Value to be provided as input
 * @see @ref _GPIO_PinStageParams "GPIO Pin Parameters Staging API"
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStageResetParams(const _gpio_pin_t pin, uint32_t crxReg)
{
    return _GPIO_PinStageParams(pin, _GPIO_PIN_MODE_INPUT, _GPIO_PIN_CNF_INPUT_FLOATING, crxReg);
}

/**
 * @brief Stage GPIO Pin Pull-Up/Pull-Down state into the input ODR register value
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO Pin Number"
 * @param[in] pud_state Value of @ref GPIO_LL_PinParams_CNF_Input_Macros_PullConfig "Pull-Up or Pull-Down"
 * @param[in] odrReg The current staged ODR value
 * @returns The updated staged ODR register value with new PULL state
 * @note - Preferred usage is during batch update for configuration
 * @note - Register Value to be provided as input
 */
__STATIC_FORCEINLINE uint32_t _GPIO_PinStagePullConfig(const _gpio_pin_t pin, const _gpio_pin_pull_state_t pud_state, uint32_t odrReg)
{
	if(pud_state == _GPIO_PIN_CNF_INPUT_PULL_DOWN) odrReg &= ~GPIO_LL_GET_PIN_MASK(pin);
	else if (pud_state == _GPIO_PIN_CNF_INPUT_PULL_UP) odrReg |= GPIO_LL_GET_PIN_MASK(pin);
	return odrReg;
}

/** @} */ // GPIO_02_LL_03_PinParams

/*---------------------------------------------- GPIO LL Pin ----------------------------------------------*/




// /** @} */ // GPIO_02_LL_03_PinParams

// /**
//  * @brief Lock GPIO pin configuration
//  * @param[in] GPIOx Target GPIO Port
//  * @param[in] pin Pin Number (0-15)
//  * @return _gpio_lock_status_t Lock operation status
//  * 
//  * @details
//  * Implements the hardware locking sequence to permanently protect GPIO pin
//  * configuration until next system reset. The function follows the exact
//  * sequence specified in the STM32F1 reference manual.
//  * 
//  * @locking_sequence
//  * The function automatically performs:
//  * 1. Write LCKR = (pin_mask | LCKK)  [LCKK = 1]
//  * 2. Write LCKR = (pin_mask)          [LCKK = 0]  
//  * 3. Write LCKR = (pin_mask | LCKK)  [LCKK = 1]
//  * 4. Read LCKK bit to verify success
//  * 
//  * @warning Once locked, the pin configuration cannot be changed until
//  *          the next system reset. Use this function with extreme caution.
//  * 
//  * @note Locking affects the entire port but only the specified pin's
//  *       configuration is protected from modification.
//  */
// __STATIC_FORCEINLINE _gpio_lock_status_t _GPIO_LockPin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
// {
//     const uint32_t lock_key = BIT_MASK(16) | BIT_MASK(pin);
//     // Strict locking sequence per reference manual
//     __GPIO_WriteLCKR(GPIOx, lock_key);
//     __GPIO_WriteLCKR(GPIOx, (lock_key & ~BIT_MASK(16)));  
//     __GPIO_WriteLCKR(GPIOx, lock_key);
//     // Hardware verification
//     return (__GPIO_ReadLCKR(GPIOx) & BIT_MASK(16)) ? _GPIO_LOCK_SUCCESS : _GPIO_LOCK_FAILED;
// }

// /**
//  * @brief Check if GPIO pin configuration is locked
//  * @param[in] GPIOx Target GPIO Port
//  * @param[in] pin Pin Number (0-15)
//  * @return _gpio_lock_status_t Lock status (_GPIO_LOCK_ENABLED or _GPIO_LOCK_DISABLED)
//  * 
//  * @details
//  * Verifies whether a specific pin's configuration is currently locked by
//  * checking both the global lock status (LCKK bit) and the individual pin's
//  * lock bit in the LCKR register.
//  * 
//  * @note This function only checks the lock status - it does not attempt
//  *       to modify or verify the actual pin configuration.
//  */
// __STATIC_FORCEINLINE _gpio_lock_status_t _GPIO_IsPinLocked(const GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
// {
//     return (__GPIO_ReadLCKR(GPIOx) & (BIT_MASK(16) | BIT_MASK(pin))) ? _GPIO_LOCK_ENABLED : _GPIO_LOCK_DISABLED;
// }

// /** @} */ // GPIO_02_LL_03_Lock

// /** @} */ // GPIO_02_LL

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* GPIO_LL_H_ */